Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/the_tanaiste.html.txt.tmx
Source language: en
Languages: ga

source: The Constitution states that the Taoiseach must nominate a member of Dáil Eireann for the position of Tanaiste
ga: Deir An Bunreacht go gcaithfidh an Taoiseach ball de Dáil Eireann a ainmniú mar Thánaiste

source: The Tanaiste is the deputy Taoiseach
ga: Is é/í an Tánaiste an Leas-Thaoiseach

source: They act in place of the Taoiseach if the Taoiseach is abroad or ill
ga: Feidhmníonn sé/sí in áit an Taoisigh má tá an Taoiseach thar lear nó tinn

source: If the Taoiseach were to die or become permanently incapacitated, the Tanaiste would stand in until a new Taoiseach was appointed
ga: Dá dtarlódh sé go bhfaigheadh an Taoiseach bás nó go mbeadh sé/sí faoi mhíchumas buan, sheasfadh an Tánaiste isteach go dtí go mbeadh Taoiseach nua tofa

source: The Tanaiste may also hold a ministerial portfolio, which means that they may also be a minister of a Department of State
ga: Is féidir leis an Tánaiste Aireacht a bheith aige/aici freisin, rud a fhágann go mbíonn sé/sí freisin ina (h)Aire ar Roinn Stáit

source: Information on the current Tanaiste is available here
ga: Tá eolas ar an Tánaiste láithreach anseo

source: Like the other members of the Government, the Tanaiste may be dismissed by the Taoiseach if they consider that there is sufficient reason to do so
ga: Is féidir leis an Taoiseach an Tánaiste a chur as an bpost, díreach mar is féidir leis /léi aon Aire eile a chur as a p(h)ost, má cheapann sé/sí go bhfuil cúis mhaith chun sin a dhéanamh
